InformationRegisters/ПланПродажТехнологов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ПланПродажТехнологов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Технолог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПланПродажТехнологов/Ext/ManagerModule.bsl
Процедура ЗаписатьДанныеВПлан(Технолог, НомерГод, НомерМесяц, Номенклатура, Количество) Экспорт
	
	ДатаПериода = НачалоМесяца(Дата(НомерГод,НомерМесяц,1,0,0,1));
	ПланНаборЗаписей = РегистрыСведений.ПланПродажТехнологов.СоздатьНаборЗаписей();
	ПланНаборЗаписей.Отбор.Год.Установить(НомерГод);
	ПланНаборЗаписей.Отбор.Месяц.Установить(ДатаПериода);
	ПланНаборЗаписей.Отбор.Технолог.Установить(Технолог);
	ПланНаборЗаписей.Отбор.Номенклатура.Установить(Номенклатура);
	ПланНаборЗаписей.Прочитать();
	Если ПланНаборЗаписей.Количество() = 0 Тогда
		НовыйПлан = ПланНаборЗаписей.Добавить();
	Иначе
		НовыйПлан = ПланНаборЗаписей[0];
	КонецЕсли;
	НовыйПлан.Год = НомерГод;
	НовыйПлан.Месяц = ДатаПериода;
	НовыйПлан.Технолог = Технолог;
	НовыйПлан.Номенклатура = Номенклатура;
	НовыйПлан.Количество = Количество;
	ПланНаборЗаписей.Записать(Истина);
	
КонецПроцедуры

Процедура УдалитьДанныеИзПлана(Технолог, НомерГод, НомерМесяц, Номенклатура) Экспорт
	
	ДатаПериода = НачалоМесяца(Дата(НомерГод,НомерМесяц,1,0,0,1));
	ПланНаборЗаписей = РегистрыСведений.ПланПродажТехнологов.СоздатьНаборЗаписей();
	ПланНаборЗаписей.Отбор.Год.Установить(НомерГод);
	ПланНаборЗаписей.Отбор.Месяц.Установить(ДатаПериода);
	ПланНаборЗаписей.Отбор.Технолог.Установить(Технолог);
	ПланНаборЗаписей.Отбор.Номенклатура.Установить(Номенклатура);
	ПланНаборЗаписей.Прочитать();
	ПланНаборЗаписей.Удалить(0);
	ПланНаборЗаписей.Записать();
	
КонецПроцедуры
